АлогистикТест2/src/Documents/алк_УстановкаФактическихПоказателей/алк_УстановкаФактическихПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_УстановкаФактическихПоказателей</name>
  <registerRecords>InformationRegister.алк_ФактическиеПоказателиПроизводства</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДействияФакта</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействияФакта</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Показатели</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.алк_ОперацииПроизводства</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Смена</name>
      <type>
        <types>CatalogRef.алк_Смены</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Documents/алк_УстановкаФактическихПоказателей/ManagerModule.bsl
Процедура ИнициализироватьДанныеДокумента(Документ, ДополнительныеСвойства) Экспорт
	
	ДополнительныеСвойства.Вставить("ФактическиеПоказателиПроизводства", ПолучитьФактическиеПоказателиПроизводства(Документ));
	
КонецПроцедуры

Функция ПолучитьФактическиеПоказателиПроизводства(Документ)
	
	Запрос = новый Запрос(
	"ВЫБРАТЬ
	|	алк_УстановкаФактическихПоказателейПоказатели.Период,
	|	алк_УстановкаФактическихПоказателейПоказатели.Смена,
	|	алк_УстановкаФактическихПоказателейПоказатели.Показатель,
	|	алк_УстановкаФактическихПоказателейПоказатели.Значение,
	|	ИСТИНА КАК Активность
	|ИЗ
	|	Документ.алк_УстановкаФактическихПоказателей.Показатели КАК алк_УстановкаФактическихПоказателейПоказатели
	|ГДЕ
	|	алк_УстановкаФактическихПоказателейПоказатели.Ссылка = &Документ");
	Запрос.УстановитьПараметр("Документ", Документ);
	ТаблицаРегистра = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаРегистра;

КонецФункции

Процедура ДобавитьДвижениеРегистраФактическиеПоказателиПроизводства(Документ, ДополнительныеСвойства, Отказ) Экспорт
	
	Если ДополнительныеСвойства.ФактическиеПоказателиПроизводства.Количество() = 0 тогда
		Сообщить("Не указаны производственные показатели");
		Отказ = Истина;
		Возврат;
	КонецЕсли; 
	
	Движения = Документ.Движения.алк_ФактическиеПоказателиПроизводства;
	Движения.Записывать = Истина;
	
	Движения.Загрузить(ДополнительныеСвойства.ФактическиеПоказателиПроизводства);

КонецПроцедуры
